vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503_RCC_registers.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually! 
 * If corrections are needed, use the 
 * override mechanism(s) defined to modify the parsed results 
 * and re-run the script to update the file. 
 *
 * This file contains the RCC register type definitions for the stm32h503 series of chips. 
 */

#pragma once
#include "../stm32_gen_common.h"
#include "stm32h503_RCC_index.h"


typedef union { 
	struct {
		uint32_t HSION         : 1; // /*!< Internal High Speed oscillator (HSI) clock enable */
		uint32_t HSIRDY        : 1; // /*!< Internal High Speed oscillator (HSI) clock ready flag */
		uint32_t HSIKERON      : 1; // /*!< Internal High Speed oscillator (HSI) clock enable for some IPs Kernel */
		uint32_t HSIDIV        : 2; // /*!< Internal High Speed clock divider selection */
		uint32_t HSIDIVF       : 1; // /*!< HSI Divider flag */
		uint32_t _reserved6    : 2; 
		uint32_t CSION         : 1; // /*!< The Internal RC 4MHz oscillator (CSI) clock enable */
		uint32_t CSIRDY        : 1; // /*!< The Internal RC 4MHz oscillator (CSI) clock ready */
		uint32_t CSIKERON      : 1; // /*!< The Internal RC 4MHz oscillator (CSI) clock enable for some IPs Kernel */
		uint32_t _reserved11   : 1; 
		uint32_t HSI48ON       : 1; // /*!< HSI48 clock enable */
		uint32_t HSI48RDY      : 1; // /*!< HSI48 clock ready */
		uint32_t _reserved14   : 2; 
		uint32_t HSEON         : 1; // /*!< External High Speed oscillator (HSE) clock enable */
		uint32_t HSERDY        : 1; // /*!< External High Speed oscillator (HSE) clock ready */
		uint32_t HSEBYP        : 1; // /*!< External High Speed oscillator (HSE) clock bypass */
		uint32_t HSECSSON      : 1; // /*!< HSE Clock Security System enable */
		uint32_t HSEEXT        : 1; // /*!< External High Speed clock type in Bypass mode */
		uint32_t _reserved21   : 3; 
		uint32_t PLL1ON        : 1; // /*!< System PLL clock enable */
		uint32_t PLL1RDY       : 1; // /*!< System PLL clock ready */
		uint32_t PLL2ON        : 1; // /*!< PLL2 enable */
		uint32_t PLL2RDY       : 1; // /*!< PLL2 ready */
		uint32_t _reserved28   : 4; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,cr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,cr),bits);

typedef union { 
	struct {
		uint32_t HSICAL        :12; // /*!< HSICAL[11:0] bits */
		uint32_t _reserved12   : 4; 
		uint32_t HSITRIM       : 7; // /*!< HSITRIM[6:0] bits */
		uint32_t _reserved23   : 9; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,hsicfgr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,hsicfgr),bits);

typedef union { 
	struct {
		uint32_t HSI48CAL      :10; // /*!< HSI48CAL[8:0] bits */
		uint32_t _reserved10   :22; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,crrcr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,crrcr),bits);

typedef union { 
	struct {
		uint32_t CSICAL        : 8; // /*!< CSICAL[7:0] bits */
		uint32_t _reserved8    : 8; 
		uint32_t CSITRIM       : 6; // /*!< CSITRIM[5:0] bits */
		uint32_t _reserved22   :10; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,csicfgr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,csicfgr),bits);

typedef union { 
	struct {
		uint32_t SW            : 2; // /*!< SW[1:0] bits (System clock Switch) */
		uint32_t _reserved2    : 1; 
		uint32_t SWS           : 2; // /*!< SWS[1:0] bits (System Clock Switch Status) */
		uint32_t _reserved5    : 1; 
		uint32_t STOPWUCK      : 1; // /*!< Wake Up from stop and HSE CSS backup clock selection */
		uint32_t STOPKERWUCK   : 1; // /*!< Kernel Clock Selection after a Wake Up from STOP */
		uint32_t RTCPRE        : 6; // /*!< HSE division factor for RTC Clock */
		uint32_t _reserved14   : 1; 
		uint32_t TIMPRE        : 1; // /*!< 0x00008000 */
		uint32_t _reserved16   : 2; 
		uint32_t MCO1PRE       : 4; // /*!< 0x003C0000 */
		uint32_t MCO1SEL       : 3; // /*!< 0x01C00000 */
		uint32_t MCO2PRE       : 4; // /*!< 0x1E000000 */
		uint32_t MCO2SEL       : 3; // /*!< 0xE0000000 */
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,cfgr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,cfgr1),bits);

typedef union { 
	struct {
		uint32_t HPRE          : 4; // /*!< HPRE[3:0] bits (AHB prescaler) */
		uint32_t PPRE1         : 3; // /*!< PPRE1[2:0] bits (APB1 prescaler) */
		uint32_t _reserved7    : 1; 
		uint32_t PPRE2         : 3; // /*!< PPRE2[2:0] bits (APB2 prescaler) */
		uint32_t _reserved11   : 1; 
		uint32_t PPRE3         : 3; // /*!< PPRE3[2:0] bits (APB3 prescaler) */
		uint32_t _reserved15   : 1; 
		uint32_t AHB1DIS       : 1; // /*!< AHB1 clock disable */
		uint32_t AHB2DIS       : 1; // /*!< AHB2 clock disable */
		uint32_t _reserved18   : 2; 
		uint32_t APB1DIS       : 1; // /*!< APB1 clock disable */
		uint32_t APB2DIS       : 1; // /*!< APB2 clock disable */
		uint32_t APB3DIS       : 1; // /*!< APB3 clock disable */
		uint32_t _reserved23   : 9; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,cfgr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,cfgr2),bits);

typedef union { 
	struct {
		uint32_t PLL1SRC       : 2; 
		uint32_t PLL1RGE       : 2; 
		uint32_t PLL1FRACEN    : 1; 
		uint32_t PLL1VCOSEL    : 1; 
		uint32_t _reserved6    : 2; 
		uint32_t PLL1M         : 6; 
		uint32_t _reserved14   : 2; 
		uint32_t PLL1PEN       : 1; 
		uint32_t PLL1QEN       : 1; 
		uint32_t PLL1REN       : 1; 
		uint32_t _reserved19   :13; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,pll1cfgr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,pll1cfgr),bits);

typedef union { 
	struct {
		uint32_t PLL2SRC       : 2; 
		uint32_t PLL2RGE       : 2; 
		uint32_t PLL2FRACEN    : 1; 
		uint32_t PLL2VCOSEL    : 1; 
		uint32_t _reserved6    : 2; 
		uint32_t PLL2M         : 6; 
		uint32_t _reserved14   : 2; 
		uint32_t PLL2PEN       : 1; 
		uint32_t PLL2QEN       : 1; 
		uint32_t PLL2REN       : 1; 
		uint32_t _reserved19   :13; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,pll2cfgr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,pll2cfgr),bits);

