vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503_RCC_registers.h
typedef union { 
	struct {
		uint32_t PLL1N         : 9; 
		uint32_t PLL1P         : 7; 
		uint32_t PLL1Q         : 7; 
		uint32_t _reserved23   : 1; 
		uint32_t PLL1R         : 7; 
		uint32_t _reserved31   : 1; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,pll1divr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,pll1divr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 3; 
		uint32_t PLL1FRACN     :13; 
		uint32_t _reserved16   :16; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,pll1fracr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,pll1fracr),bits);

typedef union { 
	struct {
		uint32_t PLL2N         : 9; 
		uint32_t PLL2P         : 7; 
		uint32_t PLL2Q         : 7; 
		uint32_t _reserved23   : 1; 
		uint32_t PLL2R         : 7; 
		uint32_t _reserved31   : 1; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,pll2divr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,pll2divr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 3; 
		uint32_t PLL2FRACN     :13; 
		uint32_t _reserved16   :16; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,pll2fracr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,pll2fracr),bits);

typedef union { 
	struct {
		uint32_t LSIRDYIE      : 1; 
		uint32_t LSERDYIE      : 1; 
		uint32_t CSIRDYIE      : 1; 
		uint32_t HSIRDYIE      : 1; 
		uint32_t HSERDYIE      : 1; 
		uint32_t HSI48RDYIE    : 1; 
		uint32_t PLL1RDYIE     : 1; 
		uint32_t PLL2RDYIE     : 1; 
		uint32_t _reserved8    :24; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,cier); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,cier),bits);

typedef union { 
	struct {
		uint32_t LSIRDYF       : 1; 
		uint32_t LSERDYF       : 1; 
		uint32_t CSIRDYF       : 1; 
		uint32_t HSIRDYF       : 1; 
		uint32_t HSERDYF       : 1; 
		uint32_t HSI48RDYF     : 1; 
		uint32_t PLL1RDYF      : 1; 
		uint32_t PLL2RDYF      : 1; 
		uint32_t _reserved8    : 2; 
		uint32_t HSECSSF       : 1; 
		uint32_t _reserved11   :21; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,cifr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,cifr),bits);

typedef union { 
	struct {
		uint32_t LSIRDYC       : 1; 
		uint32_t LSERDYC       : 1; 
		uint32_t CSIRDYC       : 1; 
		uint32_t HSIRDYC       : 1; 
		uint32_t HSERDYC       : 1; 
		uint32_t HSI48RDYC     : 1; 
		uint32_t PLL1RDYC      : 1; 
		uint32_t PLL2RDYC      : 1; 
		uint32_t _reserved8    : 2; 
		uint32_t HSECSSC       : 1; 
		uint32_t _reserved11   :21; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,cicr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,cicr),bits);

typedef union { 
	struct {
		uint32_t GPDMA1RST     : 1; 
		uint32_t GPDMA2RST     : 1; 
		uint32_t _reserved2    :10; 
		uint32_t CRCRST        : 1; 
		uint32_t _reserved13   : 4; 
		uint32_t RAMCFGRST     : 1; 
		uint32_t _reserved18   : 6; 
		uint32_t TZSC1RST      : 1; 
		uint32_t _reserved25   : 7; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ahb1rstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ahb1rstr),bits);

typedef union { 
	struct {
		uint32_t GPIOARST      : 1; 
		uint32_t GPIOBRST      : 1; 
		uint32_t GPIOCRST      : 1; 
		uint32_t GPIODRST      : 1; 
		uint32_t _reserved4    : 3; 
		uint32_t GPIOHRST      : 1; 
		uint32_t _reserved8    : 2; 
		uint32_t ADCRST        : 1; 
		uint32_t DAC1RST       : 1; 
		uint32_t _reserved12   : 5; 
		uint32_t HASHRST       : 1; 
		uint32_t RNGRST        : 1; 
		uint32_t PKARST        : 1; 
		uint32_t _reserved20   :12; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ahb2rstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ahb2rstr),bits);

typedef union { 
	struct {
		uint32_t TIM2RST       : 1; 
		uint32_t TIM3RST       : 1; 
		uint32_t _reserved2    : 2; 
		uint32_t TIM6RST       : 1; 
		uint32_t TIM7RST       : 1; 
		uint32_t _reserved6    : 7; 
		uint32_t OPAMPRST      : 1; 
		uint32_t SPI2RST       : 1; 
		uint32_t SPI3RST       : 1; 
		uint32_t COMPRST       : 1; 
		uint32_t USART2RST     : 1; 
		uint32_t USART3RST     : 1; 
		uint32_t _reserved19   : 2; 
		uint32_t I2C1RST       : 1; 
		uint32_t I2C2RST       : 1; 
		uint32_t I3C1RST       : 1; 
		uint32_t CRSRST        : 1; 
		uint32_t _reserved25   : 7; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,apb1lrstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb1lrstr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 3; 
		uint32_t DTSRST        : 1; 
		uint32_t _reserved4    : 1; 
		uint32_t LPTIM2RST     : 1; 
		uint32_t _reserved6    : 3; 
		uint32_t FDCANRST      : 1; 
		uint32_t _reserved10   :22; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,apb1hrstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb1hrstr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    :11; 
		uint32_t TIM1RST       : 1; 
		uint32_t SPI1RST       : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t USART1RST     : 1; 
		uint32_t _reserved15   : 9; 
		uint32_t USBRST        : 1; 
		uint32_t _reserved25   : 7; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,apb2rstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb2rstr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 6; 
		uint32_t LPUART1RST    : 1; 
		uint32_t _reserved7    : 2; 
		uint32_t I3C2RST       : 1; 
		uint32_t _reserved10   : 1; 
		uint32_t LPTIM1RST     : 1; 
		uint32_t _reserved12   :20; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,apb3rstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,apb3rstr),bits);

typedef union { 
	struct {
		uint32_t GPDMA1EN      : 1; 
		uint32_t GPDMA2EN      : 1; 
		uint32_t _reserved2    : 6; 
		uint32_t FLITFEN       : 1; 
		uint32_t _reserved9    : 3; 
		uint32_t CRCEN         : 1; 
		uint32_t _reserved13   : 4; 
		uint32_t RAMCFGEN      : 1; 
		uint32_t _reserved18   : 6; 
		uint32_t TZSC1EN       : 1; 
		uint32_t _reserved25   : 3; 
		uint32_t BKPRAMEN      : 1; 
		uint32_t _reserved29   : 2; 
		uint32_t SRAM1EN       : 1; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ahb1enr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ahb1enr),bits);

