vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503_RCC_registers.h
typedef union { 
	struct {
		uint32_t USART1SEL     : 3; 
		uint32_t USART2SEL     : 3; 
		uint32_t USART3SEL     : 3; 
		uint32_t _reserved9    :22; 
		uint32_t TIMICSEL      : 1; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ccipr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr1),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 8; 
		uint32_t LPTIM1SEL     : 3; 
		uint32_t _reserved11   : 1; 
		uint32_t LPTIM2SEL     : 3; 
		uint32_t _reserved15   :17; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ccipr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr2),bits);

typedef union { 
	struct {
		uint32_t SPI1SEL       : 3; 
		uint32_t SPI2SEL       : 3; 
		uint32_t SPI3SEL       : 3; 
		uint32_t _reserved9    :15; 
		uint32_t LPUART1SEL    : 3; 
		uint32_t _reserved27   : 5; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ccipr3); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr3),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 2; 
		uint32_t SYSTICKSEL    : 2; 
		uint32_t USBSEL        : 2; 
		uint32_t _reserved6    :10; 
		uint32_t I2C1SEL       : 2; 
		uint32_t I2C2SEL       : 2; 
		uint32_t _reserved20   : 4; 
		uint32_t I3C1SEL       : 2; 
		uint32_t I3C2SEL       : 2; 
		uint32_t _reserved28   : 4; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ccipr4); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr4),bits);

typedef union { 
	struct {
		uint32_t ADCDACSEL     : 3; 
		uint32_t DACSEL        : 1; 
		uint32_t RNGSEL        : 2; 
		uint32_t _reserved6    : 2; 
		uint32_t FDCANSEL      : 2; 
		uint32_t _reserved10   :20; 
		uint32_t CKERPSEL      : 2; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,ccipr5); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,ccipr5),bits);

typedef union { 
	struct {
		uint32_t LSEON         : 1; 
		uint32_t LSERDY        : 1; 
		uint32_t LSEBYP        : 1; 
		uint32_t LSEDRV        : 2; 
		uint32_t LSECSSON      : 1; 
		uint32_t LSECSSD       : 1; 
		uint32_t LSEEXT        : 1; 
		uint32_t RTCSEL        : 2; 
		uint32_t _reserved10   : 5; 
		uint32_t RTCEN         : 1; 
		uint32_t VSWRST        : 1; 
		uint32_t _reserved17   : 7; 
		uint32_t LSCOEN        : 1; 
		uint32_t LSCOSEL       : 1; 
		uint32_t LSION         : 1; 
		uint32_t LSIRDY        : 1; 
		uint32_t _reserved28   : 4; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,bdcr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,bdcr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    :23; 
		uint32_t RMVF          : 1; 
		uint32_t _reserved24   : 2; 
		uint32_t PINRSTF       : 1; 
		uint32_t BORRSTF       : 1; 
		uint32_t SFTRSTF       : 1; 
		uint32_t IWDGRSTF      : 1; 
		uint32_t WWDGRSTF      : 1; 
		uint32_t LPWRRSTF      : 1; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,rsr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,rsr),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 1; 
		uint32_t PRIV          : 1; 
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(h503_rcc,privcfgr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_rcc,privcfgr),bits);

static const stm32_reginfo_t stm32_h503_rcc_reginfo[RI_END] = 
{ 
	[RI_CR             ] = { .reset_val = 0x0000002B, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0F1F373F }, /* mask = 0b00001111000111110011011100111111 */
	[RI_HSICFGR        ] = { .reset_val = 0x00400000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0x007F0FFF }, /* mask = 0b00000000011111110000111111111111 */
	[RI_CRRCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0x000003FF }, /* mask = 0b00000000000000000000001111111111 */
	[RI_CSICFGR        ] = { .reset_val = 0x00200000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0x003F00FF }, /* mask = 0b00000000001111110000000011111111 */
	[RI_CFGR1          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFC00C0, .mask = 0xFFFCBFDB }, /* mask = 0b11111111111111001011111111011011 */
	[RI_CFGR2          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0073777F }, /* mask = 0b00000000011100110111011101111111 */
	[RI_PLL1CFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000002C, .mask = 0x00073F3F }, /* mask = 0b00000000000001110011111100111111 */
	[RI_PLL2CFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000002C, .mask = 0x00073F3F }, /* mask = 0b00000000000001110011111100111111 */
	[RI_PLL1DIVR       ] = { .reset_val = 0x01010280, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x7F7FFFFF }, /* mask = 0b01111111011111111111111111111111 */
	[RI_PLL1FRACR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFF8 }, /* mask = 0b00000000000000001111111111111000 */
	[RI_PLL2DIVR       ] = { .reset_val = 0x01010280, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x7F7FFFFF }, /* mask = 0b01111111011111111111111111111111 */
	[RI_PLL2FRACR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFF8 }, /* mask = 0b00000000000000001111111111111000 */
	[RI_CIER           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_CIFR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000004FF }, /* mask = 0b00000000000000000000010011111111 */
	[RI_CICR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000004FF }, /* mask = 0b00000000000000000000010011111111 */
	[RI_AHB1RSTR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01021003 }, /* mask = 0b00000001000000100001000000000011 */
	[RI_AHB2RSTR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000E0C8F }, /* mask = 0b00000000000011100000110010001111 */
	[RI_APB1LRSTR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01E7E033 }, /* mask = 0b00000001111001111110000000110011 */
	[RI_APB1HRSTR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000228 }, /* mask = 0b00000000000000000000001000101000 */
	[RI_APB2RSTR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01005800 }, /* mask = 0b00000001000000000101100000000000 */
	[RI_APB3RSTR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000A40 }, /* mask = 0b00000000000000000000101001000000 */
	[RI_AHB1ENR        ] = { .reset_val = 0x90000100, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x91021103 }, /* mask = 0b10010001000000100001000100000011 */
	[RI_AHB2ENR        ] = { .reset_val = 0x40000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x400E0C8F }, /* mask = 0b01000000000011100000110010001111 */
	[RI_APB1LENR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01E7E833 }, /* mask = 0b00000001111001111110100000110011 */
	[RI_APB1HENR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000228 }, /* mask = 0b00000000000000000000001000101000 */
	[RI_APB2ENR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01005800 }, /* mask = 0b00000001000000000101100000000000 */
	[RI_APB3ENR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00200A42 }, /* mask = 0b00000000001000000000101001000010 */
	[RI_AHB1LPENR      ] = { .reset_val = 0xFFFFFFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xB1021103 }, /* mask = 0b10110001000000100001000100000011 */
	[RI_AHB2LPENR      ] = { .reset_val = 0xFFFFFFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x40060C8F }, /* mask = 0b01000000000001100000110010001111 */
	[RI_APB1LLPENR     ] = { .reset_val = 0xFFFFFFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01E7E833 }, /* mask = 0b00000001111001111110100000110011 */
	[RI_APB1HLPENR     ] = { .reset_val = 0xFFFFFFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000228 }, /* mask = 0b00000000000000000000001000101000 */
	[RI_APB2LPENR      ] = { .reset_val = 0xFFFFFFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01005800 }, /* mask = 0b00000001000000000101100000000000 */
	[RI_APB3LPENR      ] = { .reset_val = 0xFFFFFFFF, .not_reserved = true, .unimp_mask = 0x00200000, .mask = 0x00200A42 }, /* mask = 0b00000000001000000000101001000010 */
	[RI_CCIPR1         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x800001FF }, /* mask = 0b10000000000000000000000111111111 */
	[RI_CCIPR2         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00007700, .mask = 0x00007700 }, /* mask = 0b00000000000000000111011100000000 */
	[RI_CCIPR3         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x07000000, .mask = 0x070001FF }, /* mask = 0b00000111000000000000000111111111 */
	[RI_CCIPR4         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0F0F003C }, /* mask = 0b00001111000011110000000000111100 */
	[RI_CCIPR5         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000308, .mask = 0xC000033F }, /* mask = 0b11000000000000000000001100111111 */
	[RI_BDCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0F0183FF }, /* mask = 0b00001111000000011000001111111111 */
	[RI_RSR            ] = { .reset_val = 0x0C000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFC800000 }, /* mask = 0b11111100100000000000000000000000 */
	[RI_PRIVCFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000002, .mask = 0x00000002 }, /* mask = 0b00000000000000000000000000000010 */
}; 


