vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503_RCC_registers.h
typedef union { 
	struct {
		REGDEF_NAME(h503_rcc,cr) CR;
		uint32_t _reserved0x4[ 3]; 
		REGDEF_NAME(h503_rcc,hsicfgr) HSICFGR;
		REGDEF_NAME(h503_rcc,crrcr) CRRCR;
		REGDEF_NAME(h503_rcc,csicfgr) CSICFGR;
		REGDEF_NAME(h503_rcc,cfgr1) CFGR1;
		REGDEF_NAME(h503_rcc,cfgr2) CFGR2;
		uint32_t _reserved0x24;
		REGDEF_NAME(h503_rcc,pll1cfgr) PLL1CFGR;
		REGDEF_NAME(h503_rcc,pll2cfgr) PLL2CFGR;
		uint32_t _reserved0x30;
		REGDEF_NAME(h503_rcc,pll1divr) PLL1DIVR;
		REGDEF_NAME(h503_rcc,pll1fracr) PLL1FRACR;
		REGDEF_NAME(h503_rcc,pll2divr) PLL2DIVR;
		REGDEF_NAME(h503_rcc,pll2fracr) PLL2FRACR;
		uint32_t _reserved0x44[ 3]; 
		REGDEF_NAME(h503_rcc,cier) CIER;
		REGDEF_NAME(h503_rcc,cifr) CIFR;
		REGDEF_NAME(h503_rcc,cicr) CICR;
		uint32_t _reserved0x5C;
		REGDEF_NAME(h503_rcc,ahb1rstr) AHB1RSTR;
		REGDEF_NAME(h503_rcc,ahb2rstr) AHB2RSTR;
		uint32_t _reserved0x68[ 3]; 
		REGDEF_NAME(h503_rcc,apb1lrstr) APB1LRSTR;
		REGDEF_NAME(h503_rcc,apb1hrstr) APB1HRSTR;
		REGDEF_NAME(h503_rcc,apb2rstr) APB2RSTR;
		REGDEF_NAME(h503_rcc,apb3rstr) APB3RSTR;
		uint32_t _reserved0x84;
		REGDEF_NAME(h503_rcc,ahb1enr) AHB1ENR;
		REGDEF_NAME(h503_rcc,ahb2enr) AHB2ENR;
		uint32_t _reserved0x90[ 3]; 
		REGDEF_NAME(h503_rcc,apb1lenr) APB1LENR;
		REGDEF_NAME(h503_rcc,apb1henr) APB1HENR;
		REGDEF_NAME(h503_rcc,apb2enr) APB2ENR;
		REGDEF_NAME(h503_rcc,apb3enr) APB3ENR;
		uint32_t _reserved0xAC;
		REGDEF_NAME(h503_rcc,ahb1lpenr) AHB1LPENR;
		REGDEF_NAME(h503_rcc,ahb2lpenr) AHB2LPENR;
		uint32_t _reserved0xB8[ 3]; 
		REGDEF_NAME(h503_rcc,apb1llpenr) APB1LLPENR;
		REGDEF_NAME(h503_rcc,apb1hlpenr) APB1HLPENR;
		REGDEF_NAME(h503_rcc,apb2lpenr) APB2LPENR;
		REGDEF_NAME(h503_rcc,apb3lpenr) APB3LPENR;
		uint32_t _reserved0xD4;
		REGDEF_NAME(h503_rcc,ccipr1) CCIPR1;
		REGDEF_NAME(h503_rcc,ccipr2) CCIPR2;
		REGDEF_NAME(h503_rcc,ccipr3) CCIPR3;
		REGDEF_NAME(h503_rcc,ccipr4) CCIPR4;
		REGDEF_NAME(h503_rcc,ccipr5) CCIPR5;
		uint32_t _reserved0xEC;
		REGDEF_NAME(h503_rcc,bdcr) BDCR;
		REGDEF_NAME(h503_rcc,rsr) RSR;
		uint32_t _reserved0xF8[ 7]; 
		REGDEF_NAME(h503_rcc,privcfgr) PRIVCFGR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END]; 
}  REGDEF_NAME(h503,rcc); 
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(h503,rcc)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CR) != 0, "Offset mismatch for CR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), HSICFGR) != 16, "Offset mismatch for HSICFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CRRCR) != 20, "Offset mismatch for CRRCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CSICFGR) != 24, "Offset mismatch for CSICFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CFGR1) != 28, "Offset mismatch for CFGR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CFGR2) != 32, "Offset mismatch for CFGR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PLL1CFGR) != 40, "Offset mismatch for PLL1CFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PLL2CFGR) != 44, "Offset mismatch for PLL2CFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PLL1DIVR) != 52, "Offset mismatch for PLL1DIVR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PLL1FRACR) != 56, "Offset mismatch for PLL1FRACR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PLL2DIVR) != 60, "Offset mismatch for PLL2DIVR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PLL2FRACR) != 64, "Offset mismatch for PLL2FRACR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CIER) != 80, "Offset mismatch for CIER");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CIFR) != 84, "Offset mismatch for CIFR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CICR) != 88, "Offset mismatch for CICR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), AHB1RSTR) != 96, "Offset mismatch for AHB1RSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), AHB2RSTR) != 100, "Offset mismatch for AHB2RSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB1LRSTR) != 116, "Offset mismatch for APB1LRSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB1HRSTR) != 120, "Offset mismatch for APB1HRSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB2RSTR) != 124, "Offset mismatch for APB2RSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB3RSTR) != 128, "Offset mismatch for APB3RSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), AHB1ENR) != 136, "Offset mismatch for AHB1ENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), AHB2ENR) != 140, "Offset mismatch for AHB2ENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB1LENR) != 156, "Offset mismatch for APB1LENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB1HENR) != 160, "Offset mismatch for APB1HENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB2ENR) != 164, "Offset mismatch for APB2ENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB3ENR) != 168, "Offset mismatch for APB3ENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), AHB1LPENR) != 176, "Offset mismatch for AHB1LPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), AHB2LPENR) != 180, "Offset mismatch for AHB2LPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB1LLPENR) != 196, "Offset mismatch for APB1LLPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB1HLPENR) != 200, "Offset mismatch for APB1HLPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB2LPENR) != 204, "Offset mismatch for APB2LPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), APB3LPENR) != 208, "Offset mismatch for APB3LPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CCIPR1) != 216, "Offset mismatch for CCIPR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CCIPR2) != 220, "Offset mismatch for CCIPR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CCIPR3) != 224, "Offset mismatch for CCIPR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CCIPR4) != 228, "Offset mismatch for CCIPR4");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), CCIPR5) != 232, "Offset mismatch for CCIPR5");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), BDCR) != 240, "Offset mismatch for BDCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), RSR) != 244, "Offset mismatch for RSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,rcc), PRIVCFGR) != 276, "Offset mismatch for PRIVCFGR");
